### 3. Keyworded Argument

-  When we assign some values to a variable in the function call, then it is known as keyworded argument 
- The varibale name for the keyworded argument should be the same in both function definition as well as in the function call 
- For keyworded argument the position or order does not matter 
- Keyworded argument should be placed after the positional arguments

In [1]:
def course(a,b):
    print(a)
    print(b)

In [3]:
a = 'MCA' # a is a positional argument 
course(a, b ='MBA')  # b is a keyworded argument

MCA
MBA

In [8]:
x = 'MCA'
course(x, b = 'MBA')

MCA
MBA

In [7]:
c = 'B.tech'
course(c, d = 'LLB')

TypeError: course() got an unexpected keyword argument 'd'

In [5]:
c = 'B.tech'
course(c, b = 'LLB')

B.tech
LLB

In [6]:
course(c = 'B.tech', b='LLB')

TypeError: course() got an unexpected keyword argument 'c'

In [9]:
course(a = 'B.tech', b='LLB')

B.tech
LLB

### 4. Variable length argument

- If we dont know the number of arguments to be passed, then we will use the variable length argument
- It stores all the values in a tuple 
- The variable length argument should come after my position argument

In [10]:
def function_name(*a): # here a is a variable length argument 
    code
    code

In [11]:
def course(*a): # i have craeted a function with a variable length argument which is going to account for possible number of argument the person can pass
    print(a, type(a))

In [12]:
course('DA', 'DSFC', 'ADSAI', 'ADSML', 'DSML' 'DSBFSI', 'DSMP')

('DA', 'DSFC', 'ADSAI', 'ADSML', 'DSMLDSBFSI', 'DSMP') <class 'tuple'>

In [14]:
course('Btech', 'MBA', "MCA")

('Btech', 'MBA', 'MCA') <class 'tuple'>

In [17]:
# create a function that adds n numbers takes as an argument and returns the sum of it

def add(*x):
    s = 0 # initialising a variable which is going to store the sum of all the numbers at the end
    
    for i in x:
        s = s+i
        
    return s

In [24]:
add(1,2,3, 4,5)

15

In [ ]:
s = 0
i = 1, s = s+i ----> s = 0+1--- s = 1
i = 2. s = s+i -----> s = 1+2 ----> s = 3
i = 3, s = s+i -----> s = 3+3 ----> s = 6
i = 4. s = s+i, ---- s = 6+4 ------> s = 10
i = 5, s = s+i -------s = 10+5 ----- s = 15

In [27]:
def add(a,b,*c):
    s = a+b
    print(a, b, s)
    print(c)
    
    for i in c:
        s = s+i
    return s

In [28]:
add(1,2,3,4,5)

1 2 3
(3, 4, 5)

15

In [29]:
def add(*a, b,c):
    s = a+b
    print(a, b, s)
    print(c)
    
    for i in c:
        s = s+i
    return s

In [30]:
add(1,2,3,4,5)

TypeError: add() missing 2 required keyword-only arguments: 'b' and 'c'

### 5. Keyworded Variable length argument

- When we don't know how many keyworded arguments are there then we will use keyworded variable length argument
- It will store the values as a dictionary 
- The variable becomes the keys and the values becomes the values associated to that keyword

def function_name(**a):
    code 
    code
    
fuction_name(keys = values, keys = value.......)

In [32]:
def course(**a):
    print(a, type(a))

In [33]:
course('DA', 'DSFC', 'ADSAI', 'ADSML', 'DSML' 'DSBFSI', 'DSMP')

TypeError: course() takes 0 positional arguments but 6 were given

In [34]:
course(a = 'DS', b = 'DSFC')

{'a': 'DS', 'b': 'DSFC'} <class 'dict'>

In [38]:
def course(a,b, c= 'DA', *x):
    print(a,b,c)
    print(*x)

In [39]:
course('DS','DSFC', "DSAI", "DSML")

DS DSFC DSAI
DSML

In [44]:
def num(b=10, *a):
    print(b)
    print(a, type(a))
    
    
  
num(None,"rajesh",78,"whatever","""hello""",'b')

None
('rajesh', 78, 'whatever', 'hello', 'b') <class 'tuple'>

In [45]:
num()

10
() <class 'tuple'>

### Anonymous Function or Lambda functions 

- The functions where we are not giving any name, those functions are called as anonymous functions or Lambda functions
- lambda keyword will be used to declare an anonymous function

    Syntax:
        
            (lambda argument:operation) (call)

In [46]:
# create a lambda function that can add two numbers

(lambda a,b:a+b)  (10,20)

30

In [47]:
(lambda a,b:a*b)  (10,20)

200

### we can assign lambda () to a variable an then we can call the variable n number of times

In [48]:
max = (lambda a,b: a if a>b else b) (20,200)

In [49]:
max

200

In [50]:
a = 10
b = 20

max = (lambda a,b: a if a>b else b)  (a,b)
max

20

In [51]:
# take 3 numbers and return the maximum number using anonymous functions
a,b,c = 10,20,30
max = lambda a,b,c : a if a>b and a>c else b if b>a and b >c else c
max(a,b,c)

30

In [55]:
# create a lambda function which takes input from the user and tells you that the number is even or not

even_odd = lambda a : 'even' if a % 2 == 0 else 'odd'

even_odd(eval(input('enter a num:')))

enter a num:10

'even'

In [57]:
import seaborn as sns

In [58]:
df = sns.load_dataset('titanic')

In [59]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
male - 1
femlaes - 0

In [61]:
df['sex'] = df.sex.apply(lambda x: 1 if x == 'male' else 0)

In [62]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,0,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,0,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,0,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,1,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,1,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,0,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,0,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,1,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,1,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
First - 1
Second - 2
Third - 3

### filter(), map() and reduce()

### filter()

- It takes two arguments, the first argument is a function and the second argument is going to be an iterable object
- It filters the values from an iterable on the basis of some condition
- It returns a filter object
- To fetch the values from the object, we have to typecast it to a list or a tuple

In [63]:
lst = [i for i in range(1,11)]
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [64]:
res = [i for i in lst if i%2 == 0]
res

[2, 4, 6, 8, 10]

In [65]:
def even(x):
    if x%2==0:
        return x

In [66]:
f = filter(even, lst)
f

In [67]:
a = list(f)
a

[2, 4, 6, 8, 10]

In [74]:
f = filter(lambda x: x%2 ==0 , lst)
f

In [76]:
a = list(f)
a

[2, 4, 6, 8, 10]

In [81]:
text = 'Hello everyone. I hope your learning is going well'
# get all the vowels in a lst

vowels = list(filter(lambda x: x.lower() in 'aeiou', text))
print(vowels)

['e', 'o', 'e', 'e', 'o', 'e', 'I', 'o', 'e', 'o', 'u', 'e', 'a', 'i', 'i', 'o', 'i', 'e']

In [77]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,0,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,0,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,0,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,1,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,1,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,0,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,0,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,1,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,1,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [78]:
df[(df['sex']==1)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,1,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,1,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,1,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,1,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,1,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,1,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,1,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,1,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,1,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [85]:
text="Hello evryone i hope your learning well"
vowel=(filter(lambda x: x in 'AEIOUaeiou',text))
print(vowel)

<filter object at 0x00000211D69F9CF0>

In [1]:
def code(*a,b=10):
    print(b)
    print(a)
code(1,2,3,b)

NameError: name 'b' is not defined

In [4]:
text ='hello guys hope you are doing well'
vowels='aeiouAEIOU'
identify_vowels=list(filter (lambda x:x in vowels,text))
print(identify_vowels)

['e', 'o', 'u', 'o', 'e', 'o', 'u', 'a', 'e', 'o', 'i', 'e']